In [1]:
import pandas as pd
import numpy as np

In [11]:
df = pd.DataFrame({
    'a':[4,5,6],'b':[7,8,9],'c':[10,11,12]},
    index=[['d','d','e'],[1,2,2]]
)

In [14]:
df.index.names = ['n', 'v']

In [15]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [16]:
df['a'] != 7

n  v
d  1    True
   2    True
e  2    True
Name: a, dtype: bool

In [17]:
df[df['a'] != 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [25]:
df['a'].isin([4])

n  v
d  1     True
   2    False
e  2    False
Name: a, dtype: bool

In [26]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [27]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [28]:
pd.isnull(df).sum()

a    0
b    0
c    0
dtype: int64

In [30]:
pd.notnull(df)

        a     b     c
n v
d 1  True  True  True
  2  True  True  True
e 2  True  True  True

In [31]:
pd.notnull(df).sum()

a    3
b    3
c    3
dtype: int64

In [32]:
df.isnull()

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [35]:
# 행에 값이 존재하는지 확인
df.any()

a    True
b    True
c    True
dtype: bool